# A thorough guide to Pandas DataFrame

*Data frames* are the central concept in Pandas; they rely on *Pandas Series*.

## Pandas series

A Pandas Series, `pandas.Series`, is a one-dimensional `numpy.ndarray` with axis labels (including time series):

In [4]:
import pandas as pd

s = pd.Series([0, 1, 2, 3, 4, 5 , 6 , 8 , 9])
s

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    8
8    9
dtype: int64

A *data frame* is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure akin to SQL table or Excel spreadsheet. It constituted of columns and rows. Columns and rows are separate `pandas.Series` objects. A rows is also qualified as *observation*, or *entry*.

## Creating a data frame

In [5]:
import numpy as np

df = pd.DataFrame([("falcon", 389.0),
                   ("parrot", 24.0),
                   ("golden eagle", 320),
                   ("lion", 80.5),
                   ("monkey", np.nan),
                   ("cow", 40),
                   ("zebra", 65),],
                  columns=("animal", "max_speed"))
df

         animal  max_speed
0        falcon      389.0
1        parrot       24.0
2  golden eagle      320.0
3          lion       80.5
4        monkey        NaN
5           cow       40.0
6         zebra       65.0

## Data frame indices

By default, indices correspond to those of the recorded rows. They can be named:

In [6]:
import numpy as np

df = pd.DataFrame([("bird", 389.0),
                   ("bird", 24.0),
                   ("bird", 320),
                   ("mammal", 80.5),
                   ("mammal", np.nan),
                   ("mammal", 40),
                   ("mammal", 65),],
                  index=["falcon", 'parrot', "golden eagle", "lion", "monkey", "cow", "zebra"],
                  columns=("cls", "max_speed"))
df

                 cls  max_speed
falcon          bird      389.0
parrot          bird       24.0
golden eagle    bird      320.0
lion          mammal       80.5
monkey        mammal        NaN
cow           mammal       40.0
zebra         mammal       65.0

### Accessing the indices (`pandas.DataFrame.index`)

`pandas.DataFrame.index` contains the index, i.e. row labels, of the DataFrame:

In [7]:
df.index

Index(['falcon', 'parrot', 'golden eagle', 'lion', 'monkey', 'cow', 'zebra'], dtype='object')

Turning the indices into a Numpy array:

In [8]:
df.index.values

array(['falcon', 'parrot', 'golden eagle', 'lion', 'monkey', 'cow',
       'zebra'], dtype=object)

Iterating over indices:

In [9]:
for i in df.index:
    print(i)

falcon
parrot
golden eagle
lion
monkey
cow
zebra

### Updating data frame indices

In [10]:
df2 = pd.DataFrame(df.values, 
                   index=["{} ({})".format(i, df["cls"][i][0]) for i in df.index],
                   columns=df.columns)
df2

                     cls max_speed
falcon (b)          bird     389.0
parrot (b)          bird      24.0
golden eagle (b)    bird     320.0
lion (m)          mammal      80.5
monkey (m)        mammal       NaN
cow (m)           mammal      40.0
zebra (m)         mammal      65.0

## Data frame columns

In [12]:
df

                 cls  max_speed
falcon          bird      389.0
parrot          bird       24.0
golden eagle    bird      320.0
lion          mammal       80.5
monkey        mammal        NaN
cow           mammal       40.0
zebra         mammal       65.0

A data frame is traversed along (iterated over) its column indices, i.e. axis $1$'s indices.

In [13]:
for c in df:
    print(c)

cls
max_speed

### Accessing a specific column:

In [14]:
df.cls

falcon            bird
parrot            bird
golden eagle      bird
lion            mammal
monkey          mammal
cow             mammal
zebra           mammal
Name: cls, dtype: object

or:

In [15]:
df["cls"]

falcon            bird
parrot            bird
golden eagle      bird
lion            mammal
monkey          mammal
cow             mammal
zebra           mammal
Name: cls, dtype: object

### Accessing the column indices: `pandas.DataFrame.columns`

In [16]:
df.columns

Index(['cls', 'max_speed'], dtype='object')

### Iterating over columns: `items()` and `iteritems()`

In [12]:
df

                 cls  max_speed
falcon          bird      389.0
parrot          bird       24.0
golden eagle    bird      320.0
lion          mammal       80.5
monkey        mammal        NaN
cow           mammal       40.0
zebra         mammal       65.0

`pandas.DataFrame.items()` and `pandas.DataFrame.iteritems()`, which have the same behaviour, iterate over `(column name, Series)` pairs, where the `Series` object corresponds to the series of values of column `column name`:

In [13]:
for c in df.iteritems():
    print(c, '\n')

('cls', falcon            bird
parrot            bird
golden eagle      bird
lion            mammal
monkey          mammal
cow             mammal
zebra           mammal
Name: cls, dtype: object)

('max_speed', falcon          389.0
parrot           24.0
golden eagle    320.0
lion             80.5
monkey            NaN
cow              40.0
zebra            65.0
Name: max_speed, dtype: float64)

For each column, the indices and their corresponding values in each column are displayed.

### Creating a new column

In [14]:
df["weight"] = [1, 4, 5.5, 160, 37, 1000, 400]
df

                 cls  max_speed  weight
falcon          bird      389.0     1.0
parrot          bird       24.0     4.0
golden eagle    bird      320.0     5.5
lion          mammal       80.5   160.0
monkey        mammal        NaN    37.0
cow           mammal       40.0  1000.0
zebra         mammal       65.0   400.0

### Selecting a subset of columns

In [15]:
df[["cls", "weight"]]

                 cls  weight
falcon          bird     1.0
parrot          bird     4.0
golden eagle    bird     5.5
lion          mammal   160.0
monkey        mammal    37.0
cow           mammal  1000.0
zebra         mammal   400.0

## DataFrame rows

As seen above a data frame is traversed along its columns. However, it is sliced along its rows:

In [16]:
df[:2]

         cls  max_speed  weight
falcon  bird      389.0     1.0
parrot  bird       24.0     4.0

It cannot be indexed by means of integers through the indexing operators `[]`, i.e. selection by position, though:

In [17]:
try:
    df[0]
except:
    print("Error: A DataFrame cannot be accessed via any integer.")

Error: A DataFrame cannot be accessed via any integer.

### Row indices (`df.index`)

As seen above, `df.index` returns the rows' indices:

In [18]:
df.index

Index(['falcon', 'parrot', 'golden eagle', 'lion', 'monkey', 'cow', 'zebra'], dtype='object')

### Iterating over rows: `iterrows()`

`pandas.DataFrame.iterrows()` iterates over DataFrame rows by returning `(index, Series)` pairs:

In [19]:
for r in df.iterrows():
    print(r, '\n')

('falcon', cls           bird
max_speed    389.0
weight         1.0
Name: falcon, dtype: object)

('parrot', cls          bird
max_speed    24.0
weight        4.0
Name: parrot, dtype: object)

('golden eagle', cls           bird
max_speed    320.0
weight         5.5
Name: golden eagle, dtype: object)

('lion', cls          mammal
max_speed      80.5
weight        160.0
Name: lion, dtype: object)

('monkey', cls          mammal
max_speed       NaN
weight         37.0
Name: monkey, dtype: object)

('cow', cls          mammal
max_speed      40.0
weight       1000.0
Name: cow, dtype: object)

('zebra', cls          mammal
max_speed      65.0
weight        400.0
Name: zebra, dtype: object)

Comparison with `iteritems()`:

In [20]:
for c in df.iteritems():
    print(c, '\n')

('cls', falcon            bird
parrot            bird
golden eagle      bird
lion            mammal
monkey          mammal
cow             mammal
zebra           mammal
Name: cls, dtype: object)

('max_speed', falcon          389.0
parrot           24.0
golden eagle    320.0
lion             80.5
monkey            NaN
cow              40.0
zebra            65.0
Name: max_speed, dtype: float64)

('weight', falcon             1.0
parrot             4.0
golden eagle       5.5
lion             160.0
monkey            37.0
cow             1000.0
zebra            400.0
Name: weight, dtype: float64)

## Accessing DataFrame elements

Accessing first a column, then a row by using the indexing operators `[]`:

In [21]:
df["max_speed"]["parrot"]

24.0

### Accessing rows via their index labels: `pandas.DataFrame.loc`

`pandas.DataFrame.loc` allows accessing a group of rows and columns by their index labels or a boolean array.

Accessing a given row and column with `loc`:

In [22]:
df.loc["parrot", "max_speed"]

24.0

identical to:

In [23]:
df.loc["parrot"]["max_speed"]

24.0

Accessing a group of rows and columns with `loc`:

In [24]:
df.loc[["parrot", "falcon"], ["cls", "max_speed"]]

         cls  max_speed
parrot  bird       24.0
falcon  bird      389.0

or

In [25]:
df.loc[("parrot", "falcon"), ("cls", "max_speed")]

         cls  max_speed
parrot  bird       24.0
falcon  bird      389.0

In [17]:
df.loc[["parrot", "falcon"]][["cls", "max_speed"]]

         cls  max_speed
parrot  bird       24.0
falcon  bird      389.0

Accessing a row for all columns with `loc`:

In [26]:
df.loc["parrot"]

cls          bird
max_speed    24.0
weight        4.0
Name: parrot, dtype: object

### `pandas.DataFrame.at`

`pandas.DataFrame.at` accesses a single value for a row-column label pair. It is similar to `pandas.DataFrame.loc` in that it provides a label-based look-up, although `loc` may access a group of rows and columns. `at` is favoured when it is only needed to get or set a single value in a `DataFrame` or `Series`.

In [27]:
df.at["falcon", "max_speed"] = 388.999
df.at["parrot", "max_speed"] = 23.999

### Accessing rows via their location-based: `pandas.DataFrame.iloc`

`pandas.DataFrame.iloc` provides purely integer location-based indexing for selection by position along the rows, contrary to `pandas.DataFrame.loc` that accesses elements by their index labels.

In [28]:
df.iloc[0]

cls             bird
max_speed    388.999
weight           1.0
Name: falcon, dtype: object

Accessing a row for a subset of columns with `iloc`:

In [63]:
df.iloc[0, [0,1]]

cls             bird
max_speed    388.999
Name: falcon, dtype: object

### Data frame's values: `pandas.DataFrame.values`

Returns a NumPy representation of the DataFrame.

In [29]:
df.values

array([['bird', 388.999, 1.0],
       ['bird', 23.999, 4.0],
       ['bird', 320.0, 5.5],
       ['mammal', 80.5, 160.0],
       ['mammal', nan, 37.0],
       ['mammal', 40.0, 1000.0],
       ['mammal', 65.0, 400.0]], dtype=object)

## Filtering and sorting

Selecting all the birds, i.e. all the rows that correspond to the class of animal "bird":

In [64]:
df[df["cls"] == "bird"]

               cls  max_speed  weight
falcon        bird    388.999     1.0
parrot        bird     23.999     4.0
golden eagle  bird    320.000     5.5

Selecting all the birds that fly at more than 300 km/h:

In [69]:
df[(df["cls"] == "bird") & (df.max_speed >= 300)]

               cls  max_speed  weight
falcon        bird    388.999     1.0
golden eagle  bird    320.000     5.5

Do not forget the parentheses for each condition.

## DataFrame description

### Data frame dimensionality: `pandas.DataFrame.shape`

In [30]:
df.shape

(7, 3)

### `pandas.DataFrame.describe()`

Generates descriptive statistics such as the count, central tendency, dispersion and the shape of the dataset's distribution (quantiles, min, max, etc.). To obtain the statistics of a categorial variable, the `include` shall be set to `all`.

In [31]:
df.describe(include="all")

           cls   max_speed       weight
count        7    6.000000     7.000000
unique       2         NaN          NaN
top     mammal         NaN          NaN
freq         4         NaN          NaN
mean       NaN  153.083000   229.642857
std        NaN  158.741926   369.203051
min        NaN   23.999000     1.000000
25%        NaN   46.250000     4.750000
50%        NaN   72.750000    37.000000
75%        NaN  260.125000   280.000000
max        NaN  388.999000  1000.000000

### `n` first rows: `pandas.DataFrame.head(n=5)`

Returns the first `n` rows; useful for quickly testing if the object contains the right type of data.

In [32]:
df.head()

                 cls  max_speed  weight
falcon          bird    388.999     1.0
parrot          bird     23.999     4.0
golden eagle    bird    320.000     5.5
lion          mammal     80.500   160.0
monkey        mammal        NaN    37.0

### `pandas.DataFrame.value_counts`

`pandas.DataFrame.value_counts` returns the counts of a same row in the data frame:

In [33]:
df.value_counts()

cls     max_speed  weight
bird    23.999     4.0       1
        320.000    5.5       1
        388.999    1.0       1
mammal  40.000     1000.0    1
        65.000     400.0     1
        80.500     160.0     1
dtype: int64

In [34]:
df.loc["other zebra"] = ("mammal", 65, 400)
df

                 cls  max_speed  weight
falcon          bird    388.999     1.0
parrot          bird     23.999     4.0
golden eagle    bird    320.000     5.5
lion          mammal     80.500   160.0
monkey        mammal        NaN    37.0
cow           mammal     40.000  1000.0
zebra         mammal     65.000   400.0
other zebra   mammal     65.000   400.0

In [35]:
df.value_counts()

cls     max_speed  weight
mammal  65.000     400.0     2
bird    23.999     4.0       1
        320.000    5.5       1
        388.999    1.0       1
mammal  40.000     1000.0    1
        80.500     160.0     1
dtype: int64

### `pandas.DataFrame.round()`

Rounds a DataFrame to a variable number of decimal places:

In [36]:
df.round(2)

                 cls  max_speed  weight
falcon          bird      389.0     1.0
parrot          bird       24.0     4.0
golden eagle    bird      320.0     5.5
lion          mammal       80.5   160.0
monkey        mammal        NaN    37.0
cow           mammal       40.0  1000.0
zebra         mammal       65.0   400.0
other zebra   mammal       65.0   400.0

### `pandas.Series.str` and `pandas.Index.str`

`pandas.Series.str`, resp. `pandas.Index.str`, returns a set of vectorised string functions for string `Series`, resp. string `Index`. 

Example:

In [37]:
df.cls

falcon            bird
parrot            bird
golden eagle      bird
lion            mammal
monkey          mammal
cow             mammal
zebra           mammal
other zebra     mammal
Name: cls, dtype: object

In [38]:
df.cls.str.len()

falcon          4
parrot          4
golden eagle    4
lion            6
monkey          6
cow             6
zebra           6
other zebra     6
Name: cls, dtype: int64

In [39]:
df.cls.str.len().max()

6

In [40]:
df.cls.str.len().mean()

5.25

In [41]:
df.cls.str.len().std()

1.0350983390135313

In [42]:
df.cls.str.replace("bird", "beautiful bird")

falcon          beautiful bird
parrot          beautiful bird
golden eagle    beautiful bird
lion                    mammal
monkey                  mammal
cow                     mammal
zebra                   mammal
other zebra             mammal
Name: cls, dtype: object

With `Index`:

In [43]:
df.index.str.len()

Int64Index([6, 6, 12, 4, 6, 3, 5, 11], dtype='int64')

## Loading data

### Loading data from a CSV file: `pandas.DataFrame.read_csv(sep=',')`

In [44]:
df_titles = pd.read_csv("https://github.com/mothguib/data/raw/main/title_conference.csv", sep=',')

In [45]:
df_titles.head()

                                               Title Conference
0  Innovation in Database Management: Computer Sc...       VLDB
1  High performance prime field multiplication fo...      ISCAS
2  enchanted scissors: a scissor interface for su...   SIGGRAPH
3  Detection of channel degradation attack by Int...    INFOCOM
4  Pinning a Complex Network through the Betweenn...      ISCAS

### Loading structured data: `pandas.DataFrame.from_records()`

Let us create a text with several sentences:

In [46]:
sentences = """Thomas Jefferson began building Monticello at the\
 age of 26.\n"""
sentences += """Construction was done mostly by local masons and\
 carpenters.\n"""
sentences += "He moved into the South Pavilion in 1770.\n"
sentences += """Turning Monticello into a neoclassical masterpiece\
 was Jefferson's obsession."""

print(sentences)

Thomas Jefferson began building Monticello at the age of 26.
Construction was done mostly by local masons and carpenters.
He moved into the South Pavilion in 1770.
Turning Monticello into a neoclassical masterpiece was Jefferson's obsession.

Now, create a bag of words for each sentence:

In [47]:
corpus = {}

for i, sent in enumerate(sentences.splitlines()):
    corpus["sent{}".format(i)] = dict([(tok, 1) for tok in sent.split()])

`corpus`'s content:

In [48]:
corpus

{'sent0': {'Thomas': 1,
  'Jefferson': 1,
  'began': 1,
  'building': 1,
  'Monticello': 1,
  'at': 1,
  'the': 1,
  'age': 1,
  'of': 1,
  '26.': 1},
 'sent1': {'Construction': 1,
  'was': 1,
  'done': 1,
  'mostly': 1,
  'by': 1,
  'local': 1,
  'masons': 1,
  'and': 1,
  'carpenters.': 1},
 'sent2': {'He': 1,
  'moved': 1,
  'into': 1,
  'the': 1,
  'South': 1,
  'Pavilion': 1,
  'in': 1,
  '1770.': 1},
 'sent3': {'Turning': 1,
  'Monticello': 1,
  'into': 1,
  'a': 1,
  'neoclassical': 1,
  'masterpiece': 1,
  'was': 1,
  "Jefferson's": 1,
  'obsession.': 1}}

Data are wrapped up in a Pandas DataFrame by using `pandas.DataFrame.from_records()`, which creates a data frame from a structured ndarray, sequence of tuples or dicts, or DataFrame.

In [49]:
data = pd.DataFrame.from_records(corpus)
data

              sent0  sent1  sent2  sent3
Thomas          1.0    NaN    NaN    NaN
Jefferson       1.0    NaN    NaN    NaN
began           1.0    NaN    NaN    NaN
building        1.0    NaN    NaN    NaN
Monticello      1.0    NaN    NaN    1.0
at              1.0    NaN    NaN    NaN
the             1.0    NaN    1.0    NaN
age             1.0    NaN    NaN    NaN
of              1.0    NaN    NaN    NaN
26.             1.0    NaN    NaN    NaN
Construction    NaN    1.0    NaN    NaN
was             NaN    1.0    NaN    1.0
done            NaN    1.0    NaN    NaN
mostly          NaN    1.0    NaN    NaN
by              NaN    1.0    NaN    NaN
local           NaN    1.0    NaN    NaN
masons          NaN    1.0    NaN    NaN
and             NaN    1.0    NaN    NaN
carpenters.     NaN    1.0    NaN    NaN
He              NaN    NaN    1.0    NaN
moved           NaN    NaN    1.0    NaN
into            NaN    NaN    1.0    1.0
South           NaN    NaN    1.0    NaN
Pavilion        NaN    NaN    1.0    NaN
in              NaN    NaN    1.0    NaN
1770.           NaN    NaN    1.0    NaN
Turning         NaN    NaN    NaN    1.0
a               NaN    NaN    NaN    1.0
neoclassical    NaN    NaN    NaN    1.0
masterpiece     NaN    NaN    NaN    1.0
Jefferson's     NaN    NaN    NaN    1.0
obsession.      NaN    NaN    NaN    1.0

The data frame must be transposed because the first axis in the dictionary `corpus` makes up the columns:

In [50]:
data = data.T
data

,Thomas,Jefferson,began,building,Monticello,at,the,age,of,26.,...,South,Pavilion,in,1770.,Turning,a,neoclassical,masterpiece,Jefferson's,obsession.
sent0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
sent1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
sent2,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN,NaN,NaN,...,1.0,1.0,1.0,1.0,NaN,NaN,NaN,NaN,NaN,NaN
sent3,NaN,NaN,NaN,NaN,1.0,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,1.0,1.0,1.0,1.0,1.0,1.0

#### Determining the rows containing a NaN value

`pandas.DataFrame.isnull` or `pandas.DataFrame.isna` detect missing values, also named "not available" or "NA", by returning a boolean same-sized object indicating if the values are NA, i.e. `NaN`or `None`.

In [51]:
data.isnull()

,Thomas,Jefferson,began,building,Monticello,at,the,age,of,26.,...,South,Pavilion,in,1770.,Turning,a,neoclassical,masterpiece,Jefferson's,obsession.
sent0,False,False,False,False,False,False,False,False,False,False,...,True,True,True,True,True,True,True,True,True,True
sent1,True,True,True,True,True,True,True,True,True,True,...,True,True,True,True,True,True,True,True,True,True
sent2,True,True,True,True,True,True,False,True,True,True,...,False,False,False,False,True,True,True,True,True,True
sent3,True,True,True,True,False,True,True,True,True,True,...,True,True,True,True,False,False,False,False,False,False

`pandas.DataFrame.any` detects if there is at least one true value along a series or a data frame axis

In [52]:
data.isnull().any(axis=1)

sent0    True
sent1    True
sent2    True
sent3    True
dtype: bool

In [53]:
na_rows = data[data.isnull().any(axis=1)].head(n=15)
na_rows

,Thomas,Jefferson,began,building,Monticello,at,the,age,of,26.,...,South,Pavilion,in,1770.,Turning,a,neoclassical,masterpiece,Jefferson's,obsession.
sent0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
sent1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
sent2,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN,NaN,NaN,...,1.0,1.0,1.0,1.0,NaN,NaN,NaN,NaN,NaN,NaN
sent3,NaN,NaN,NaN,NaN,1.0,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,1.0,1.0,1.0,1.0,1.0,1.0

Filling NA values with `pandas.DataFrame.fillna()`:

In [54]:
data = data.fillna(0).astype(int)

Now in one line:

In [55]:
data = pd.DataFrame.from_records(corpus).T.fillna(0).astype(int)
data.head()

,Thomas,Jefferson,began,building,Monticello,at,the,age,of,26.,...,South,Pavilion,in,1770.,Turning,a,neoclassical,masterpiece,Jefferson's,obsession.
sent0,1,1,1,1,1,1,1,1,1,1,...,0,0,0,0,0,0,0,0,0,0
sent1,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
sent2,0,0,0,0,0,0,1,0,0,0,...,1,1,1,1,0,0,0,0,0,0
sent3,0,0,0,0,1,0,0,0,0,0,...,0,0,0,0,1,1,1,1,1,1

In [56]:
data.head()[data.columns[:15]]

,Thomas,Jefferson,began,building,Monticello,at,the,age,of,26.,Construction,was,done,mostly,by
sent0,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0
sent1,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1
sent2,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0
sent3,0,0,0,0,1,0,0,0,0,0,0,1,0,0,0

Considering that `corpus` is a dictionary, `DataFrame`'s constructor could simply have been used in this case:

In [57]:
data = pd.DataFrame(corpus).T.fillna(0).astype(int)
data[data.columns[:15]]

,Thomas,Jefferson,began,building,Monticello,at,the,age,of,26.,Construction,was,done,mostly,by
sent0,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0
sent1,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1
sent2,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0
sent3,0,0,0,0,1,0,0,0,0,0,0,1,0,0,0

`pandas.from_dict` can also be used:

In [58]:
data = pd.DataFrame.from_dict(corpus).T.fillna(0).astype(int)
data[data.columns[:15]]

,Thomas,Jefferson,began,building,Monticello,at,the,age,of,26.,Construction,was,done,mostly,by
sent0,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0
sent1,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1
sent2,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0
sent3,0,0,0,0,1,0,0,0,0,0,0,1,0,0,0

Column reindexing with `pandas.DataFrame.reindex`:

In [59]:
data = data.reindex(sorted(data.columns), axis=1)
data[data.columns[:15]]

,1770.,26.,Construction,He,Jefferson,Jefferson's,Monticello,Pavilion,South,Thomas,Turning,a,age,and,at
sent0,0,1,0,0,1,0,1,0,0,1,0,0,1,0,1
sent1,0,0,1,0,0,0,0,0,0,0,0,0,0,1,0
sent2,1,0,0,1,0,0,0,1,1,0,0,0,0,0,0
sent3,0,0,0,0,0,1,1,0,0,0,1,1,0,0,0

======================================================

Author: William Othmani-Guibourg